# `.value_counts()` on a DataFrame
Remeber that `.value_counts()` is only available on Series but you can extract a series then use `.value_counts()`.

### Import Pandas

In [1]:
import pandas as pd

### U.S. Major League Soccer Salaries

In [6]:
### U.S. Major League Soccer Salaries
salaries = pd.read_csv("mls_salaries.csv")
salaries.head()

  club last_name first_name position  base_salary  guaranteed_compensation
0  ATL   Almiron     Miguel        M    1912500.0               2297000.00
1  ATL   Ambrose      Mikey        D      65625.0                 65625.00
2  ATL      Asad      Yamil        M     150000.0                150000.00
3  ATL     Bloom       Mark        D      99225.0                106573.89
4  ATL  Carleton     Andrew        F      65000.0                 77400.00

### `.value_counts()`

In [11]:
salaries["club"].value_counts()

VAN      32
PHI      31
ATL      31
CLB      30
ORL      30
DAL      29
SJ       29
NYCFC    28
HOU      28
NYRB     28
TOR      27
RSL      27
POR      27
MTL      27
CHI      27
MNUFC    27
LA       27
DC       27
KC       26
COL      26
SEA      25
NE       23
LAFC      2
Name: club, dtype: int64

In [13]:
salaries["position"].value_counts()

M      206
D      182
F      108
GK      64
M-F     18
D-M     14
F-M      6
M-D      4
M/F      1
F/M      1
Name: position, dtype: int64

In [14]:
salaries["position"].value_counts().head(1)

M    206
Name: position, dtype: int64

In [22]:
salaries["base_salary"].value_counts(ascending=False)

53004.0     44
65004.0     33
65625.0     19
65000.0     19
150000.0    15
            ..
106312.5     1
96800.0      1
850000.0     1
202000.0     1
126500.0     1
Name: base_salary, Length: 248, dtype: int64